name: "shape_pred_layers"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "gt_shape"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "ShapePredictionDataLayer"
    param_str: "-b 40 -wh 224 224 -m 103.0626238 115.90288257 123.15163084"
  }
}
