name: "crop_pred_layers"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "gt_bbx_amodal"
  top: "gt_bbx_crop"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "CropPredictionDataLayer"
    param_str: "-b 40 -wh 224 224 -m 103.0626238 115.90288257 123.15163084"
  }
}

layer {
  name: "create_crop_offset_targets"
  type: "Python"
  bottom: "gt_bbx_amodal"
  bottom: "gt_bbx_crop"
  top: "position_offset"
  top: "size_offset"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "GenerateBoxOffsetTargets"
  }
}

layer {
  name: "create_amodal_from_crop_offsets"
  type: "Python"
  bottom: "position_offset"
  bottom: "size_offset"
  bottom: "gt_bbx_crop"
  top: "pred_bbx_amodal"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "InvertBoxOffsetTargets"
  }
}

layer {
  name: "compute_ious"
  type: "Python"
  bottom: "gt_bbx_amodal"
  bottom: "pred_bbx_amodal"
  top: "ious"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "BoxOverlapIoU"
  }
}