name: "data_layer"
layer {
  name: "data_layer"
  type: "Python"
  top: "input_image"
  top: "gt_viewpoint"
  top: "gt_bbx_amodal"
  top: "gt_bbx_crop"
  top: "gt_center_proj"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "DataLayer"
    param_str: "-b 40 -wh 224 224 -m 103.0626238 115.90288257 123.15163084 -f 0.5 -t input_image viewpoint bbx_amodal bbx_crop center_proj"
  }
}

layer {
  name:"viewpoint_quantizer"
  type: "Python"
  bottom: "gt_viewpoint"
  top: "gt_viewpoint_label"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "QuantizeViewPoint"
    param_str: "--num_of_bins 96"
  }
}

layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "gt_viewpoint_label"
  top: "gt_vp_azimuth_label"
  top: "gt_vp_elevation_label"
  top: "gt_vp_tilt_label"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
  }
}

layer {
  name:"gt_center_proj_targets"
  type: "Python"
  bottom: "gt_center_proj"
  bottom: "gt_bbx_crop"
  top: "gt_center_proj_targets"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "Coord2DTransformation"
    param_str: "--offsets 0.5"
  }
}

layer {
  name:"gt_bbx_amodal_targets"
  type: "Python"
  bottom: "gt_bbx_amodal"
  bottom: "gt_bbx_crop"
  top: "gt_bbx_amodal_targets"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "Coord2DTransformation"
    param_str: "--offsets 0.0 1.0"
  }
}

layer {
  name:"pred_center_proj"
  type: "Python"
  bottom: "gt_center_proj_targets"
  bottom: "gt_bbx_crop"
  top: "pred_center_proj"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "Coord2DTransformationInverse"
    param_str: "--offsets 0.5"
  }
}

layer {
  name:"pred_bbx_amodal"
  type: "Python"
  bottom: "gt_bbx_amodal_targets"
  bottom: "gt_bbx_crop"
  top: "pred_bbx_amodal"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "Coord2DTransformationInverse"
    param_str: "--offsets 0.0 1.0"
  }
}

layer {
  name: "iou_bbx_amodal"
  type: "Python"
  bottom: "pred_bbx_amodal"
  bottom: "gt_bbx_amodal"
  top: "iou_bbx_amodal"
  python_param {
    module: "RenderAndCompare.layers"
    layer: "AverageBoxOverlapIoU"
  }
}

