name: "TestForCaffeInbuiltSoftmaxWithTemperatureLayer"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 5 dim: 3 } }
}

layer {
  name: "divide_by_fixedT"
  type: "Scale"
  bottom: "data"
  top: "data_by_fixedT"
  scale_param {
    filler {  type: "constant"  value: 1000.0 }
    bias_term: false
  }
  param {lr_mult: 0 decay_mult: 0}
}

layer {
  type: "Softmax"
  name: "softmax_prob_fixedT"
  bottom: "data_by_fixedT"
  top: "softmax_prob_fixedT"
}

layer {
  name: "T"
  type: "Input"
  top: "T"
  input_param { shape: { dim: 5 dim: 1} }
}

layer {
  type: "Flatten"
  bottom: "T"
  top: "flatT"
  name: "flatT"
}

layer {
  name: "1_by_T"
  bottom: "flatT"
  top: "1_by_T"
  type: "Power"
  power_param {
    power: -1
    scale: 1
    shift: 0
  }
}

layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "data"
  top: "fc1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
  name: "fc1_by_T"
  type: "Scale"
  bottom: "fc1"
  bottom: "1_by_T"
  top: "fc1_by_T"
  scale_param {
    axis: 0
  }
}

layer {
  type: "Softmax"
  name: "softmax_prob2"
  bottom: "fc1_by_T"
  top: "softmax_prob2"
}